import type { QuizQuestion } from "./index";

export const seerahQuestions: QuizQuestion[] = [  
   {
    question: "من قائل: لا إله إلا أنت سبحانك إني كنت من الظالمين؟",
    answer: "يونس",
    },
    {
    question: "كم كان عمر النبي ﷺ عند نزول الوحي؟",
    answer: "40",
    },
    {
    question: "كم عدد أبناء النبي ﷺ ذكورًا وإناثًا؟",
    answer: "7",
    },
    {
    question: "لماذا خسر المسلمون في غزوة أحد؟",
    answer: "مخالفة أمر النبي وترك الرماة مواقعهم",
    },
    {
    question: "بماذا رد الله البصر لسيدنا يعقوب؟",
    answer: "قميص يوسف",
    },
    {
    question: "ما اسم الجبل الذي كلم الله فيه موسى؟",
    answer: "طور سيناء",
   },
   {
    question: "كم سنة استمرت الدعوة في المدينة؟",
    answer: "10",
    },
    {
     question: "لماذا ابتلع الحوت يونس عليه السلام؟",
     answer: "ترك قومه بدون إذن الله",
    },
    {
      
     question: "ما المعجزة التي حدثت عند غار ثور أثناء الهجرة؟",
     answer: "عش الحمام وخيوط العنكبوت",
    },
    {
     question: "من هو النبي الذي رآه النبي ﷺ يصلي في قبره ليلة الإسراء؟",
     answer: "موسى", 
    },
    {
     question: "من النبي الذي قُبضت روحه في السماء؟",
     answer: "إدريس",
    },
    {
     question: "من هو النبي الذي لُقب بـ \"شيخ المرسلين\"؟",
     answer: "نوح",
    },
    {
     question: "من هو أول من خط بالقلم؟",
     answer: "إدريس",
    },
    {
     question: "من هو الذي أوحى الله إليه وليس من الإنس ولا من الجن ولا من الملائكة؟",
     answer: "النحل",
    },
    {  
     question: "ما هو اسم والدة النبي محمد ﷺ؟",
     answer: "آمنة بنت وهب",
    },
    {
     question: "كم سنة استمرت الدعوة في مكة؟",
     answer: "13 سنة",
    },
    {
     question: "ما اسم ابن نوح الذي غرق؟",
     answer: "كنعان",
    },
    {
     question: "من هي أكبر بنات الرسول ﷺ سنًا؟",
     answer: "زينب",
     },
     {
      question: "كيف كانت نهاية الملك الذي جادل إبراهيم؟",
      answer: "دخلت بعوضة في رأسه",
     },
     {
      question: "لماذا كان فرعون يقتل ذكور بني إسرائيل؟",
      answer: "خوفًا من مولود من بني إسرائيل يزول ملكه بسببه"
     },
     {
      question: "من هو النبي الذي دعا ربه: لا تذر على الأرض من الكافرين ديارًا؟",
      answer: "نوح",
     },
     {
      question: "كم عدد المسلمين في غزوة بدر تقريبًا؟",
      answer: "313"
     },
     {
      question: "من هو النبي الذي قال: رب إني مسني الضر وأنت أرحم الراحمين؟",
      answer: "أيوب",
     },
     {
      question: "في أي معركة خرج النبي دون قتال فعلي؟",
      answer: "تبوك",
     },
     {
      question: "متى توفي النبي محمد صلى الله عليه وسلم؟",
      answer: "11 هـ",
     },
     {
      question: "إبراهيم عليه السلام ترك زوجته في مكة بأمر من الله، ما اسمها؟",
      answer: "هاجر",
    },
    {
      question: "من هو النبي الذي قال: إنما أشكو بثي وحزني إلى الله؟",
      answer: "يعقوب",
    },
    {
      question: "من أول نبي بعد آدم عليه السلام ذُكر في القرآن الكريم؟",
      answer: "إدريس",
    },
    {
      question: "من هو الملك الذي جادل إبراهيم؟",
      answer: "النمرود",
    },
    {
      question: "كم سنة دعا نوح قومه؟",
      answer: "950",
    },
    {
      question: "من هو النبي الذي تكلم وهو في المهد؟",
      answer: "عيسى",
    },
    {
      question: "من هو النبي الذي كان يعمل حدادًا؟",
      answer: "داود",
    },
    {
      question: "في أي عام وُلد النبي محمد صلى الله عليه وسلم؟",
      answer: "عام الفيل",
    },
    {
      question: "من هو النبي ابن نبي ابن نبي ابن نبي؟",
      answer: "يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم السلام",
    },
    {
      question: "ما المعجزة التي لا تزال موجودة حتى اليوم؟",
      answer: "القرآن الكريم",
    },
    {
      question: "من هو النبي الذي أُرسل إلى قوم مدين؟",
      answer: "شعيب",
    },
    {
      question: "من قتل أبا جهل؟",
      answer: "معاذ ومعوذ",
    },
    {
      question: "من هو النبي الذي سماه الله تعالى بنفسه؟",
      answer: "يحيى عليه السلام",
    },
    {
      question: "ماذا قال الله للنار حين أُلقي فيها إبراهيم؟",
      answer: "كوني بردًا وسلامًا",
    },
    {
      question: "كم عدد أبناء يعقوب عليه السلام؟",
      answer: "12",
    },
    {
      question: "ما الشيء الذي أخرجه الله من الحجر لموسى؟",
      answer: "الماء",
    },
    {
      question: "ما اسم الغار الذي نزل فيه الوحي على النبي محمد؟",
      answer: "حراء",
    },
    {
      question: "ماذا قال جبريل للنبي محمد عند أول وحي؟",
      answer: "اقرأ",
    },
    {
      question: "ماذا كان يعمل النبي محمد قبل النبوة؟",
      answer: "راعٍ وتاجر",
    },
    {
      question: "إلى أي قوم أُرسل النبي هود؟",
      answer: "عاد",
    },
    {
      question: "إلى أي قوم أُرسل النبي صالح؟",
      answer: "ثمود",
    },
    {
     question: "ما اسم المعركة التي تُسمى أيضًا الأحزاب؟",
     answer: "الخندق",
    },
    {
      question: "ما معجزة النبي صالح؟",
      answer: "الناقة",
    },
    {
      question: "كم كان عمر النبي محمد صلى الله عليه وسلم عند وفاته؟",
      answer: "63",
    },
    {
      question: "من النبي الذي كان ملكًا ونبيًا؟",
      answer: "سليمان",
    },
];
