import type { QuizQuestion } from "./index";

export const tashQuestions: QuizQuestion[] = [

{
      question: "مين هو اول مخرج لطاش؟",
      answer: "عامر الحمود",
      options: ["موفق الصلاح", "سمير عارف", "عامر الحمود", "عبدالخالق الغانم"],
    },
    {
      question: "في حلقة الكستنائي ياهوه وش كان لون سيارة فؤاد؟",
      answer: "تركوازي",
    },
    {
      question: "وش اسم شخصيه الشايب البخيل اللي يلعب دوره عبدالله السدحان؟",
      answer: "أبو زنيفر",
    },
    {
      question: "أول قناة عرضت طاش؟",
      answer: "السعودية الأولى",
      options: ["روتانا خليجية", "القناة الرياضية", "السعودية الأولى", "MBC"],
    },
    {
      question: "وش اسم الشخصية التي كانت مع أبو مساعد في حلقة طارة أبو مساعد؟",
      image: "/images/tash.abuaradah.jpg",
      answer: "أبو عرادة",
    },
    {
     question: "ما اسم الشخصية السودانية التي قدمها ناصر القصبي في حلقة (ألو يا مرور)؟",
     answer: "أبو فاطنة",
     options: ["جعفر تاج السر", "أبو فاطنة", "عثمان", "قمر الدين"],
    },
    {
     question: "وش السبب اللي خلا داعس يحلف ينتقم من العرجا في حلقة داعس والعرجا؟",
     answer: "فقعت عينه",
     options: ["فقعت عينه", "قطعت أذنه", "سرقت حلاله", "شوهت سمعته"],
    },
    { 
     question: "وش كانت هديةالنجاخ اللي قدمها أبو عليان وسعيدان لعياله؟",
     answer: "حمار",
     image: "/images/tash-gift.jpg",
     options: ["حمار", "سيارة سواق الشيوخ", "عود", "سفره للرياض"],
    },
    {
    question: "وش اسم أخت مصطفى اللي سعيدان وعليان يحبونها؟",
    answer: "ياسمين",
    options: ["ياسمين", "سوسن", "سحر", "نسرين"],
    },
    {
    question: "ولد عم سعيدان وعليان اللي جاي من الديرة ما يحب الحمام، اجل وش يحب؟",
    image: "/images/tash-fish.jgp.png",
    answer: "السمك",
    },
    {
    question: "وش كانت رتبة أسعد عمر في طاش ما طاش؟",
    answer: "عميد",
    options: ["عميد", "عقيد", "لواء", "مقدم"],
    },
    {
    question: "وش اسم الشخصية النسائية الشهيرة اللي قدمها ناصر القصبي؟",
    answer: "سوزان",
    options: ["سوزان", "سوسن", "سنان", "سمر"]
    },
    { 
    question: "وش اسم شخصية راشد الشمراني صاحب طير سداح في طاش ما طاش؟",
    answer: "أبو الطواري",
    },
  ],
};




];
