const games = [
{
icon:"🎡",
title:"لف وخمن",

how:[
"لف العجلة",
"تظهر لك قيمة مثل 300",
"اختر حرف",
"إذا كان الحرف موجود تحصل على النقاط",
"إذا ظهر الحرف أكثر من مرة تحصل على القيمة لكل حرف",
"إذا كان الحرف غير موجود ينتقل الدور للفريق الثاني"
],

example:
"مثال: القيمة 300 والكلمة (كمبيوتر) اخترت حرف م = +300 ثم حرف ي = +300 والمجموع = 600"
},

{
icon:"💬",
title:"خمن الكلمة",

how:[
"الفريق الأول يبدأ التخمين",
"بعد كل محاولة تظهر ألوان الحروف",
"الأخضر = حرف صحيح ومكان صحيح",
"الأصفر = موجود لكن بمكان مختلف",
"الرمادي = غير موجود",
"إذا انتهت المحاولات تنتقل الفرصة"
],

example:
"مثال: كلمة (تفاح) وخمنت (تمور)، ستظهر الحروف الصحيحة والخاطئة"
},

{
icon:"❓",
title:"الأسئلة",

how:[
"الفريق الأول يبدأ",
"لديه 30 ثانية",
"إذا لم يجاوب يحصل الفريق الثاني على فرصة",
"الفريق الثاني لديه 10 ثوانٍ",
"بعدها تظهر الإجابة",
"الحكم يحدد من أخذ النقطة"
]
},

{
icon:"✏️",
title:"خمن المثل",

how:[
"يظهر مثل باستخدام إيموجيز",
"الفريق يحاول التخمين",
"إذا انتهى الوقت يحصل الفريق الثاني على فرصة",
"الفريق الصحيح يحصل على نقطة"
]
},

{
icon:"🧩",
title:"حروف بالخلاط",

how:[
"تظهر كلمة بحروف غير مرتبة",
"حاول ترتيب الحروف",
"الفريق الأسرع يحصل على النقطة"
]
},

{
icon:"🌍",
title:"إنسان حيوان نبات جماد بلاد",

how:[
"يظهر حرف معين",
"كل فريق يسجل الإجابات على جهازه",
"بعد الانتهاء يبلغ الفريق صاحب الجلسة",
"إذا كانت الإجابات صحيحة للفريقين",
"الفائز هو الأسرع"
]
}

];
